trade_exp/src/Enums/СтатусыДоговоровКонтрагентов/СтатусыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыДоговоровКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Действует</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="3915309e-1c9c-447e-82d1-cd037c7784b2">
    <name>НеСогласован</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="26b5dc0e-bfd2-43c0-b272-c13aae125257">
    <name>Закрыт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ДоговорыКонтрагентов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СуммаПрибыли</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПорядокРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДопустимаяСуммаЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПлатежиПо275ФЗ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОграничиватьСуммуЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидАгентскогоДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИдентификаторПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИностранныйИсполнительВУтвержденномПеречнеГОЗ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипПлатежаФЗ275</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>УчетАгентскогоНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗапрещаетсяПросроченнаяЗадолженность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Номер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВходящийНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КоличествоДнейПросрочки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СтатусДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РазрешитьОтгрузкуПриПревышении</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТекстДляНазначенияПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1e4d6429-3779-415e-a0fd-605e54b909fe">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e2ff70d3-ff88-44af-b741-32d672c8125a">
    <name>ПечататьВУПД</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e06bae83-ba77-48c9-bb40-159b45c72ed6">
    <name>ОплатаВВалюте</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a0241b3d-6845-4ee6-8b92-3b00a0b4c45c">
    <name>Согласован</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ec175e6e-8a0f-46c1-8f61-1933ed068350">
    <name>ДоговорСУчастникомГОЗ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d4de0c91-22dd-4ce4-bc98-884061653165">
    <name>ГосударственныйКонтракт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dd40c379-db06-454d-a768-f757b503f620">
    <name>РазрешенаРаботаСДочернимиПартнерами</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="757d135e-2285-42a9-8208-52f29d49e69e">
    <name>ИдентификаторГосКонтракта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8ab3f66d-3919-4794-9cb9-5d1357469cd5">
    <name>КомиссионныеПродажи25</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3cce95d9-af7e-4260-8c94-acb4b858ce14">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4260e299-3a49-43df-b15c-e023f1cec2d5">
    <name>СтавкаНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="79844f87-ebb9-4536-bbae-5da8b7904167">
    <name>ВариантВыбытияМаркируемойПродукции</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ПодтверждающиеДокументы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ВидДокумента</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номер</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>128</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Дата</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Файл</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="df10b069-e208-42fb-b04f-d5b5239f320e">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="92a07f04-3acc-4b83-9d37-ef44ee4db151">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="cb23b7af-c779-4ad4-99e8-4abfff8b406c">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="90605e38-9973-4892-8b74-198167fdf900">
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="73afeb44-37a7-425d-8755-c69ab50eb0b4">
    <name>Филиалы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="9950309a-c137-45a6-98c6-a27d9b40522b">
      <name>Организация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/CommonModules/ПродажиСервер/Module.bsl
&ИзменениеИКонтроль ("УстановитьДоступностьДоговора")
Процедура Док_УстановитьДоступностьДоговора(Объект, ДоступностьЭлемента, ВидимостьЭлемента, Договор = Неопределено) Экспорт
	ИспользоватьПартнеровКакКонтрагентов = ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов");
	ИспользуютсяДоговорыКонтрагентов     = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	
	ЗаполненыВлияющиеПоля = ЗначениеЗаполнено(Объект.Партнер)
							И (ЗначениеЗаполнено(Объект.Контрагент)
								Или ИспользоватьПартнеровКакКонтрагентов)
							И ЗначениеЗаполнено(Объект.Организация);
							
	#Вставка
	ИспользуетсяДоговорВДокументе = ?(Объект.Свойство("ИспользуетсяДоговор"), Объект.ИспользуетсяДоговор,ЗаполненыВлияющиеПоля);
	ЗаполненыВлияющиеПоля = ИспользуетсяДоговорВДокументе;							
	#КонецВставки
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами") Тогда
		
		ИспользуютсяДоговораПоОперации = Объект.Свойство("ХозяйственнаяОперация")
											И ОперацииИспользующиеДоговораКонтрагентов().Найти(Объект.ХозяйственнаяОперация) <> Неопределено;
		
		ЗаполненыВлияющиеПоля = ЗаполненыВлияющиеПоля
								И (ЗначениеЗаполнено(Объект.Соглашение)
									Или ИспользуютсяДоговораПоОперации);
		
		УстановитьПривилегированныйРежим(Истина);
		ИспользуютсяДоговорыКонтрагентов = ИспользуютсяДоговорыКонтрагентов
											И ((ЗначениеЗаполнено(Объект.Соглашение)
												И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Соглашение, "ИспользуютсяДоговорыКонтрагентов"))
											Или ИспользуютсяДоговораПоОперации);
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
	ДоступностьЭлемента = ЗаполненыВлияющиеПоля
							И ИспользуютсяДоговорыКонтрагентов;
	ВидимостьЭлемента   = ИспользуютсяДоговорыКонтрагентов;
	#Удаление
	Если Не ДоступностьЭлемента
		И ЗначениеЗаполнено(Объект.Договор) Тогда  
	#КонецУдаления	
	#Вставка
		Если Объект.Свойство("ИспользуетсяДоговор") Тогда
			ДоступностьЭлемента = Объект.ИспользуетсяДоговор;
			ВидимостьЭлемента   = Объект.ИспользуетсяДоговор;
			Если не ИспользуетсяДоговорВДокументе Тогда
    #КонецВставки
				Объект.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
    #Вставка
			КонецЕсли;	
		КонецЕсли;	
		
		Если НЕ ДоступностьЭлемента И ЗначениеЗаполнено(Объект.Договор) Тогда
			Объект.Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли; 
	#КонецВставки
	#Удаление	
    КонецЕсли;
	#КонецУдаления
	
КонецПроцедуры 

&После ("СформироватьЗапросШапкаДокументаПродажи")
Процедура Док_СформироватьЗапросШапкаДокументаПродажи(ТекстЗапроса, ИмяТаблицы)

	ТекстЗапроса = СТРЗаменить(ТекстЗапроса,"
	|	ВЫБОР
|		КОГДА ДокументПродажи.ПорядокРасчетов <> ВЫБОР
|													КОГДА СоглашениеСКлиентом.ИспользуютсяДоговорыКонтрагентов 
|														ТОГДА ДокументПродажи.Договор.ПорядокРасчетов
|													ИНАЧЕ СоглашениеСКлиентом.ПорядокРасчетов
|												КОНЕЦ
|			ТОГДА ИСТИНА
|		ИНАЧЕ ЛОЖЬ
|	КОНЕЦ КАК ЕстьОшибкиЗаполненияПорядокРасчетов,","
|	ЛОЖЬ КАК ЕстьОшибкиЗаполненияПорядокРасчетов,");	
	
КонецПроцедуры

&ИзменениеИКонтроль ("ПолучитьДоговорПоУмолчанию")
Функция Док_ПолучитьДоговорПоУмолчанию(
	Объект,
	ХозяйственныеОперации,
	ВалютаВзаиморасчетов = Неопределено,
	НаправлениеДеятельности = Неопределено,
	КомиссионныеПродажи25 = Неопределено
	) Экспорт    
	
	#Вставка
	если не типзнч(Объект)=тип("ДанныеФормыСтруктура") тогда
		если ОбщегоНазначения.ЕстьреквизитОбъекта("ИспользуетсяДоговор",Объект.Метаданные()) и не Объект.ИспользуетсяДоговор тогда
			Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		конецесли;	
		если ОбщегоНазначения.ЕстьреквизитОбъекта("ИспользуетсяДоговор",Объект.Метаданные()) и значениезаполнено(Объект.Договор) тогда
			Возврат Объект.Договор;
		конецесли;	
	конецесли;	
		
	если (типзнч(Объект)<>тип("ДокументОбъект.ОтчетКомиссионера") и типзнч(Объект)<>тип("ДокументОбъект.ОтчетКомиссионераОСписании")  ) и Объект.Свойство("ИспользуетсяДоговор") и не Объект.ИспользуетсяДоговор тогда
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	конецесли;	
	#КонецВставки
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами") Тогда
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	#Удаление
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами")
		И ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Объект, "Соглашение") Тогда 
		
		ПоСоглашениюИспользуютсяДоговорыКонтрагентов = ЗначениеЗаполнено(Объект.Соглашение)
			И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Соглашение, "ИспользуютсяДоговорыКонтрагентов");
		
		Если Не ПоСоглашениюИспользуютсяДоговорыКонтрагентов Тогда
			Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли;
		
	КонецЕсли; 
	#КонецУдаления
	
	СписокПартнеров = Новый СписокЗначений;
	ПартнерыИКонтрагенты.ЗаполнитьСписокПартнераСРодителями(Объект.Партнер, СписокПартнеров);
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка,
	|	ДоговорыКонтрагентов.Партнер,
	|	ДоговорыКонтрагентов.РазрешенаРаботаСДочернимиПартнерами
	|
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|
	|ГДЕ
	|	(НЕ ДоговорыКонтрагентов.ПометкаУдаления)
	|	И ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|	И ДоговорыКонтрагентов.Партнер В (&СписокПартнеров)
	|	И ДоговорыКонтрагентов.Контрагент = &Контрагент
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И ((НЕ &ОтборХозяйственнаяОперация)
	|			ИЛИ ДоговорыКонтрагентов.ХозяйственнаяОперация В (&ХозяйственнаяОперация))
	|	И ((НЕ &ОтборВалютаВзаиморасчетов)
	|			ИЛИ ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &ВалютаВзаиморасчетов)
	|	И ДоговорыКонтрагентов.Ссылка = &ТекущийДоговор
	|	И ((НЕ &ОтборНаправлениеДеятельности)
	|			ИЛИ ДоговорыКонтрагентов.НаправлениеДеятельности = &НаправлениеДеятельности)
	|	И ((НЕ &ОтборКомиссионныеПродажи25)
	|			ИЛИ ДоговорыКонтрагентов.КомиссионныеПродажи25 = &КомиссионныеПродажи25);
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	ДоговорыКонтрагентов.Ссылка,
	|	ДоговорыКонтрагентов.Партнер,
	|	ДоговорыКонтрагентов.РазрешенаРаботаСДочернимиПартнерами
	|
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|
	|ГДЕ
	|	(НЕ ДоговорыКонтрагентов.ПометкаУдаления)
	|	И ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|	И ДоговорыКонтрагентов.Партнер В (&СписокПартнеров)
	|	И ДоговорыКонтрагентов.Контрагент = &Контрагент
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И ((НЕ &ОтборХозяйственнаяОперация)
	|			ИЛИ ДоговорыКонтрагентов.ХозяйственнаяОперация В (&ХозяйственнаяОперация))
	|	И ((НЕ &ОтборВалютаВзаиморасчетов)
	|			ИЛИ ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &ВалютаВзаиморасчетов)
	|	И ((НЕ &ОтборНаправлениеДеятельности)
	|			ИЛИ ДоговорыКонтрагентов.НаправлениеДеятельности = &НаправлениеДеятельности)
	|	И ((НЕ &ОтборКомиссионныеПродажи25)
	|			ИЛИ ДоговорыКонтрагентов.КомиссионныеПродажи25 = &КомиссионныеПродажи25)
	|");
	Запрос.УстановитьПараметр("ТекущийДоговор", Объект.Договор);
	Запрос.УстановитьПараметр("СписокПартнеров", СписокПартнеров);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ОтборХозяйственнаяОперация", ЗначениеЗаполнено(ХозяйственныеОперации));
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозяйственныеОперации);
	Запрос.УстановитьПараметр("ОтборВалютаВзаиморасчетов", ЗначениеЗаполнено(ВалютаВзаиморасчетов));
	Запрос.УстановитьПараметр("ВалютаВзаиморасчетов", ВалютаВзаиморасчетов);
	Запрос.УстановитьПараметр("ОтборНаправлениеДеятельности", НаправлениеДеятельности <> Неопределено
		И ПолучитьФункциональнуюОпцию("ИспользоватьУчетДоходовПоНаправлениямДеятельности"));
	Запрос.УстановитьПараметр("НаправлениеДеятельности",НаправлениеДеятельности);
	Запрос.УстановитьПараметр("ОтборКомиссионныеПродажи25", ЗначениеЗаполнено(КомиссионныеПродажи25));
	Запрос.УстановитьПараметр("КомиссионныеПродажи25", КомиссионныеПродажи25);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ПартнерДоговора = Справочники.Партнеры.ПустаяСсылка();
	РазрешенаРаботаСДочернимиПартнерами = Ложь;
	Если Не МассивРезультатов[0].Пустой() Тогда
		
		Выборка = МассивРезультатов[0].Выбрать();
		Выборка.Следующий();
		
		ДоговорПоУмолчанию = Выборка.Ссылка;
		
		ПартнерДоговора = Выборка.Партнер;
		РазрешенаРаботаСДочернимиПартнерами = Выборка.РазрешенаРаботаСДочернимиПартнерами;
		
	Иначе
		Выборка = МассивРезультатов[1].Выбрать();
		
		Если Не Выборка.Следующий() Тогда
			ДоговорПоУмолчанию = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		ИначеЕсли Выборка.Количество() = 1 Тогда
			ДоговорПоУмолчанию = Выборка.Ссылка;	
			ПартнерДоговора = Выборка.Партнер;
			РазрешенаРаботаСДочернимиПартнерами = Выборка.РазрешенаРаботаСДочернимиПартнерами;
		Иначе
			ДоговорПоУмолчанию = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ РазрешенаРаботаСДочернимиПартнерами И ПартнерДоговора <> Объект.Партнер Тогда
		ДоговорПоУмолчанию = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();	
	КонецЕсли;
	
	Возврат ДоговорПоУмолчанию;
	
КонецФункции

&ИзменениеИКонтроль ("СформироватьЗапросНаличиеДублейЦеновыхГруппДокументаПродажи")
Процедура Док_СформироватьЗапросНаличиеДублейЦеновыхГруппДокументаПродажи(ТекстЗапроса)
	#Вставка
	Если Константы.НоваяСхемаЦенообразования.Получить() Тогда
		ТекстЗапроса = ТекстЗапроса;
	Иначе
	#КонецВставки
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	МАКСИМУМ(ДокументЦеновыеГруппы.НомерСтроки) КАК НомерСтроки,
		|	ДокументЦеновыеГруппы.ЦеноваяГруппа         КАК ЦеноваяГруппа
		|ИЗ
		|	ВременнаяТаблицаЦеновыеГруппы КАК ДокументЦеновыеГруппы
		|СГРУППИРОВАТЬ ПО
		|	ДокументЦеновыеГруппы.ЦеноваяГруппа
		|ИМЕЮЩИЕ 
		|	КОЛИЧЕСТВО (*) > 1
		|;
		|";
	#Вставка
	КонецЕсли;
	#КонецВставки
КонецПроцедуры

&ИзменениеИКонтроль ("СформироватьЗапросНаличиеДублейТоваровДокументаПродажи")
Процедура Док_СформироватьЗапросНаличиеДублейТоваровДокументаПродажи(ТекстЗапроса)
	#Вставка
	Если Константы.НоваяСхемаЦенообразования.Получить() Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	МАКСИМУМ(ДокументТовары.НомерСтроки)    КАК НомерСтроки,
		|	ДокументТовары.Номенклатура             КАК Номенклатура,
		|	ДокументТовары.Характеристика           КАК Характеристика,
		|	ДокументТовары.ВидЦены           КАК ВидЦены
		|ИЗ
		|	ВременнаяТаблицаТовары КАК ДокументТовары
		|СГРУППИРОВАТЬ ПО
		|	ДокументТовары.Номенклатура,
		|	ДокументТовары.Характеристика,
		|   ДокументТовары.ВидЦены
		|ИМЕЮЩИЕ 
		|	КОЛИЧЕСТВО (*) > 1
		|;
		|";
		
	Иначе
	#КонецВставки
		ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ
		|	МАКСИМУМ(ДокументТовары.НомерСтроки)    КАК НомерСтроки,
		|	ДокументТовары.Номенклатура             КАК Номенклатура,
		|	ДокументТовары.Характеристика           КАК Характеристика
		|ИЗ
		|	ВременнаяТаблицаТовары КАК ДокументТовары
		|СГРУППИРОВАТЬ ПО
		|	ДокументТовары.Номенклатура,
		|	ДокументТовары.Характеристика
		|ИМЕЮЩИЕ 
		|	КОЛИЧЕСТВО (*) > 1
		|;
		|"; 
	#Вставка
	КонецЕсли;
    #КонецВставки
КонецПроцедуры

&Вместо ("СообщитьОбОшибкахТоварыДокументаПродажи") 
Процедура Док_СообщитьОбОшибкахТоварыДокументаПродажи(Знач Выборка,
	                                              Знач ДокументПродажи,
	                                              Отказ,
	                                              ДеревоОтклонений = Неопределено)
// своя проверка на товары
возврат;

КонецПроцедуры

&Вместо ("СообщитьОбОшибкахСоответствиеГруппЦенНоменклатурыУсловиямПродаж") 
Процедура Док_СообщитьОбОшибкахСоответствиеГруппЦенНоменклатурыУсловиямПродаж(Знач Выборка,
	                                                                      Знач ДокументПродажи,
	                                                                      Отказ,
	                                                                      ДеревоОтклонений = Неопределено)
// своя проверка на ценовые группы
возврат;

КонецПроцедуры
